#include "enemy.h"

const Enemy s_enemy[enemy_count] =
{   
 //  name             hp    level damage loot   money
    {L"Таракан",      3,    1,    1,     6 ,    0}, //0
    {L"Цветок",       4,    1,    1,     5 ,    1}, //1
    {L"Камар",        6,    2,    1,     6 ,    2}, //2
    {L"Ёжик",         8,    2,    1,     13,    4}, //3
    {L"Крыса",        10,   3,    2,     11,    1}, //4
    {L"Голубь",       13,   4,    2,     -1,    0}, //5
    {L"Воробей",      16,   4,    2,     -1,    0}, //6
    {L"Кошка",        20,   5,    3,     12,    2}, //7
    {L"Собака",       22,   5,    3,     12,    4}, //8
    {L"Змей",         24,   6,    3,     -1,    5}, //9
    {L"Джек расл",    26,   6,    4,     7 ,    6}, //10
    {L"Овчарка",      28,   7,    4,     14,    7}, //11
    {L"Пудель",       30,   7,    4,     13,    10}, //12
    {L"Волк",         32,   8,    5,     9 ,    13}, //13
    {L"Енот",         34,   8,    5,     9 ,    15}, //14
    {L"Сороконошка",  38,   9,    5,     15,    20}, //15
    {L"Зомби",        40,   10,   6,     14,    28}, //16
};
