#include "enemy.h"

const Enemy s_enemy[enemy_count] =
{   
 //  name             hp    level damage loot   money
    {L"Таракан",      4,    2 ,    4,     6 ,    0}, //0
    {L"Цветок",       5,    2 ,    5,     5 ,    1}, //1
    {L"Комар",        6,    3 ,    5,     6 ,    2}, //2
    {L"Ёжик",         8,    6 ,    5,     13,    4}, //3
    {L"Крыса",        10,   4 ,    5,     11,    1}, //4
    {L"Голубь",       8,   5 ,    6,     -1,    0}, //5
    {L"Воробей",      16,   7 ,    2,     -1,    0}, //6
    {L"Кошка",        20,   8,     3,     12,    2}, //7
    {L"Собака",       22,   9,     3,     12,    4}, //8
    {L"Змей",         24,   10,    3,     -1,    5}, //9
    {L"Джек расл",    26,   11,    4,     7 ,    6}, //10
    {L"Овчарка",      28,   12,    4,     14,    7}, //11
    {L"Пудель",       30,   13,    4,     13,    10},//12
    {L"Волк",         32,   14,    5,     9 ,    13},//13
    {L"Енот",         34,   15,    5,     9 ,    15},//14
    {L"Сороконошка",  38,   16,    5,     15,    20},//15
    {L"Зомби",        40,   17,    6,     14,    28},//16
};
