#include "enemy.h"

const Enemy s_enemy[enemy_count] =
{   
 //  name             hp    level damage loot   money
    {L"Таракан",      4,    2 ,    4,     6 ,    0}, //0
    {L"Цветок",       5,    2 ,    5,     5 ,    1}, //1
    {L"Комар",        6,    3 ,    5,     6 ,    2}, //2
    {L"Ёжик",         8,    5 ,    4,     13,    4}, //3
    {L"Крыса",        10,   4 ,    5,     11,    1}, //4
    {L"Голубь",       6,    4 ,    4,     -1,    0}, //5
    {L"Воробей",      16,   7 ,    2,     -1,    0}, //6
    {L"Кошка",        18,   6,     5,     12,    2}, //7
    {L"Собака",       17,   6,     6,     14,    4}, //8
    {L"Змей",         15,   7,     5,     -1,    5}, //9
    {L"Джек расл",    20,   8,     4,     7 ,    6}, //10
    {L"Овчарка",      20,   9,     4,     14,    7}, //11
    {L"Пудель",       15,   10,    9,     13,    10},//12
    {L"Волк",         20,   11,    6,     9 ,    13},//13
    {L"Енот",         25,   13,    6,     9 ,    15},//14
    {L"Сороконошка",  32,   14,    5,     15,    20},//15
    {L"Зомби",        40,   17,    6,     14,    28},//16
};
