#include "room.h"
#include "item.h"

const Room s_room[room_count] =
{
    //Text                                                      Enemy
    {L"",                                                       -1   }, //0
    {L"Вы проснулись в старой хижине, и вы нечего не помните",  -1   }, //1
    {L"Вы вышли во двор",                                        1   }, //2
    {L"Вы вошли в туалет",                                      -1   }, //3
    {L"Вы вошли в коморку",                                     -1   }, //4
    {L"Вы подошли к фонтану",                                    0   }, //5
    {L"Вы зашли за домом",                                       1   }, //6
    {L"Вы подошли к березе",                                    -1   }, //7
    {L"Вы вошли в сарай",                                       -1   }, //8
    {L"Вы вышли на дорогу",                                      1   }, //9
    {L"Вы вошли в магазин бабы зин",                            -1   }, //10
    {L"Вы вошли в котедж",                                      -1   }, //11
    {L"Вы зашли на кухну",                                      -1   }, //12
    {L"Вы влители в спальную",                                  -1   }, //13
    {L"Вы кувырнулись в гостиную",                               2   }, //14
    {L"Вы боком зашли в ванную",                                -1   }, //15
    {L"Вы прыгнули в кладовку",                                 -1   }, //16
    {L"Вы пробрались сквозь мусор в сауну",                      5   }, //17
    {L"Вы вошли в аптеку!",                                     -1   }, //18
    {L"И снова уборная",                                        -1   }, //19
    {L"Вы спрыгнули в подсобку",                                 4   }, //20
    {L"Вы влители в склад",                                     -1   }, //21
    {L"Вы вошли в подвал",                                       3   }, //22
    {L"Вы приехали в тунель",                                    2   }, //23
    {L"Вы прибежали к АЗС",                                      2   }, //24
    {L"Вы подошли к колонке",                                    2   }, //25
    {L"Вы вошли в мини-маркет",                                  2   }, //26
    {L"Вы зашли в комнату отдыха",                               2   }, //27
    {L"Вы спустились в склад",                                   2   }, //28
    {L"Вы осторожно зашли в автомойку",                          2   }, //29
    {L"Вы зашли в курилку",                                      2   }, //30
    {L"Вы пришли на парковку",                                  -1   }, //31
    {L"Вы сели в автобус",                                       5   }, //32
    //{L"Вы ",                                      2   }, //33
    //{L"Вы ",                                      2   }, //34
};

int room_fight_complete[room_count];


extern const Action s_action[action_count]=
{
// Комната Тип         Текст                          Результат
    {1,  AT_LOOT,      L"Заглянуть под кровать",          0      , L""},
    {1,  AT_MESSAGE,   L"Пошарить под столом",            0      , L"Под столом пусто" },
    {1,  AT_GOTO_ROOM, L"Войти в каморку",                4      , L"" },
    {1,  AT_GOTO_ROOM, L"Войти в туалет",                 3      , L"" },
    {1,  AT_GOTO_ROOM, L"Выйти на улицу",                 2      , L"" },
                                                          
    {2,  AT_LOOT,      L"Открыть сундук",                 48     , L""},
    {2,  AT_GOTO_ROOM, L"Зайди за дом",                   6      , L""},
    {2,  AT_GOTO_ROOM, L"Подойти к фонтану",              5      , L""},
    {2,  AT_GOTO_ROOM, L"Вернуться в хижину",             1      , L""},
                                                         
    {3, AT_LOOT,       L"Обыскать унитаз",                2      , L""},
    {3, AT_HEAL,       L"Умыться в раковине",             1      , L"Вам стало легче"},
    {3, AT_GET_MONEY,  L"Поднять коврик",                 1      , L"Вы нашли секрет!"},
    {3, AT_GOTO_ROOM,  L"Вернуться в хижину",             1      , L""},
                                                          
    {4, AT_LOOT,       L"Пошариться в шкафу",             3      , L""},
    {4, AT_LOOT,       L"Обыскать мусорку",               4      , L""},
    {4, AT_GOTO_ROOM,  L"Вернуться в хижину",             1      , L""},
                                                          
    {5, AT_LOOT,       L"Поискать в воде",                16     , L""},
    {5, AT_DAMAGE,     L"Сунуть руку в трещену",          1      , L"Тебя покусали крабы"},
    {5, AT_GOTO_ROOM,  L"Подойти к березе",               7      , L""},
    {5, AT_GOTO_ROOM,  L"Пойти по узкой улицы",           9      , L""},
    {5, AT_GOTO_ROOM,  L"Вернуться во двор",              2      , L""},
                                                          
    {6, AT_LOOT,       L"Заглянуть под доску",            1     , L""},
    {6, AT_GOTO_ROOM,  L"Пойти в сарай",                  8      , L""},
    {6, AT_GOTO_ROOM,  L"Вернуться во двор",              2      , L""},
                                                          
    {7, AT_DAMAGE,     L"Ударить по березе",              1      , L"Вам стало больно"},
    {7, AT_MESSAGE,    L"Обнять березу",                  0      , L"Вы почуствали себя не одиноким"},
    {7, AT_GOTO_ROOM,  L"Вернуться к фонтану ",           5      , L""},
                                                          
    {8, AT_LOOT,       L"Посмотреть в углу",              8      , L""},
    {8, AT_HEAL,       L"Сесть на диван",                 2      , L"Вы одохнули"},
    {8, AT_GOTO_ROOM,  L"Вернуться за дом",               2      , L""},
                                                         
    {9, AT_DAMAGE,     L"Посмотреть под машыну ",         2      , L"Вас укусила крыса"},
    {9, AT_MESSAGE,    L"Посмотреть в кусты",             0      , L"Вы нашли нечего"},
    {9, AT_GOTO_ROOM,  L"Пойти в котедж",                 11     , L""},
    {9, AT_GOTO_ROOM,  L"Подойти к аптеке",               18     , L""},
    {9, AT_GOTO_ROOM,  L"Побежать на АЗС",                24     , L""},
    {9, AT_GOTO_ROOM,  L"Выйти в магазин бабы зин",       10     , L""},
    {9, AT_GOTO_ROOM,  L"Вернуться к фонтану",            5      , L""},
                                                          
    {10, AT_BUY,       L"Купить",                         9      , L""},
    {10, AT_SELL,      L"Продать",                        9      , L""},
    {10, AT_MESSAGE,   L"Закричать в микрофон",           0      , L"Торговец странно посмотрел на вас"},
    {10, AT_GOTO_ROOM, L"Вернуться на дорогу",            9      , L""},
                                                          
    {11, AT_LOST_ITEM, L"Войти в шкаф",                   USAGE_HEAD, L"Шкаф не открылься и ваза упала вам на голову"},
    {11, AT_MESSAGE,   L"Заглянуть в банкетку",           0      , L"Кроме вони там ничего не было"},
    {11, AT_GOTO_ROOM, L"Пойти в темную комнату",         14     , L""},
    {11, AT_GOTO_ROOM, L"Зайти за закрытую дверь",        13     , L""},
    {11, AT_GOTO_ROOM, L"Вернуться на дорогу",            9      , L""},
                                                          
    {12, AT_LOOT,      L"Пнуть холодильник",              11     , L""},
    {12, AT_MESSAGE,   L"Потрогать стол",                 0      , L""},
    {12, AT_LOOT,      L"Подуть в духвоку",               6      , L""},
    {12, AT_GOTO_ROOM, L"Пойти по лестнице",              14     , L""},      
    {12, AT_GOTO_ROOM, L"Вернуться в котедж",             11     , L""},
                                                          
    {13, AT_MESSAGE,   L"Глянуть на тумбочку",            0      , L"Она была красивой"},
    {13, AT_LOOT,      L"Взломать шкаф",                  61     , L""},
    {13, AT_GOTO_ROOM, L"Пойти по лестице на верх",       16     , L""},
    {13, AT_GOTO_ROOM, L"Прыгнуть в яму",                 15     , L""},
    {13, AT_GOTO_ROOM, L"Вернуться в котедж",             11     , L""},
                                                          
    {14, AT_MESSAGE,   L"Посмотреть телевизор",           0      , L"Кроме белого шума там нечего не было"},
    {14, AT_LOOT,      L"Глянуть под ковром",             54     , L""},
    {14, AT_HEAL,      L"Сесть на диван",                 2      , L"Вы отдохнули"},
    {14, AT_GOTO_ROOM, L"Пройти сзвозь трещену в стене",  17     , L""},
    {14, AT_GOTO_ROOM, L"Вернуться в котедж",             11     , L""},
                                                          
    {15, AT_HEAL,      L"Помыться в душе",                3      , L"Вы почуствовали себя пушынкой"},
    {15, AT_LOOT,      L"Осмотреть унитаз",               22     , L""},
    {15, AT_MESSAGE,   L"Глянуть в зеркало",              0      , L"Вы подумали, что за урод?"},
    {15, AT_GOTO_ROOM, L"Вернуться в спальную",           13     , L""},
                                                          
    {16, AT_DAMAGE,    L"Пнуть шкаф",                     2      , L"Вы почуствовали дежавю"},
    {16, AT_LOOT,      L"Порыться в мешках",              41     , L""},
    {16, AT_HEAL,      L"Закрыть глаза возле ямы",        1      , L"Вас нежно погладили"},
    {16, AT_GOTO_ROOM, L"Вернуться в спальную",           13     , L""},
                                                          
    {17, AT_DAMAGE,    L"Зайти в баню",                   2      , L"Вы обажглись"},
    {17, AT_MESSAGE,   L"Посмотреть в трещену",           0      , L"Вы увидели скелет"},
    {17, AT_GOTO_ROOM, L"Вернуться в Гостиную",           14     , L""},

    {18, AT_LOOT,      L"Посмотреть на полку",            76     , L""},
    {18, AT_HEAL,      L"Лечь на стол",                   1      , L"Было не удобно, но вы выспались"},
    {18, AT_GOTO_ROOM, L"Открыть страшную дверь",         19     , L""},
    {18, AT_GOTO_ROOM, L"Войти комнату без дверей",       21     , L""},
    {18, AT_GOTO_ROOM, L"Проползти под завалами",         20     , L""},
    {18, AT_GOTO_ROOM, L"Вернуться на дорогу",            17     , L""},

    {19, AT_DAMAGE,    L"Поискать в туалете",             1      , L"Так заваняло что вы упали в обморок на 1 час"},
    {19, AT_MESSAGE,   L"Умиться в раковине",             0      , L"В кране не было воды"},
    {19, AT_GOTO_ROOM, L"Вернуться в аптеку",             18     , L""},

    {20, AT_LOOT,      L"Посмотреть на мусарку",          72     , L"Повезло" },
    {20, AT_LOOT,      L"Открыть холодильник",            77     , L"" },
    {20, AT_GET_MONEY, L"Проверить касу",                 3      , L"ОГО" },
    {20, AT_GOTO_ROOM, L"Пойти в узкий ход",              22     , L""},
    {20, AT_GOTO_ROOM, L"Войти в склад",                  21     , L""},
    {20, AT_GOTO_ROOM, L"Пойти в аптеку",                 18     , L""},

    {21, AT_LOOT,      L"Сломать пожарный щит",           63     , L"" },
    {21, AT_GOTO_ROOM, L"Пойти в аптеку",                 18     , L"" },
    {21, AT_GOTO_ROOM, L"Подняться в подсобку",           20     , L"" },

    {22, AT_MESSAGE,   L"Поссать",                         0      , L"Облегчение" },
    {22, AT_GOTO_ROOM, L"Сесть вагонетку",                23     , L"" },
    {22, AT_GOTO_ROOM, L"Вернуться в подсобку",           20     , L"" },

    {23, AT_GET_MONEY, L"Пересмотреть вагонетки",         3      , L"" },
    {23, AT_MESSAGE,   L"Копать",                         0      , L"Где-же золото?" },
    {23, AT_LOOT,      L"Оглядеться",                     68     , L"" },
    {23, AT_GOTO_ROOM, L"Поехать обратно в подвал",       22     , L"" },
    {23, AT_GOTO_ROOM, L"Ехать дальше",                   9      , L"" },

    {24, AT_MESSAGE,   L"Крикнуть",                       0      , L"Вас некто не услышал"},
    {24, AT_GOTO_ROOM, L"Пойти на запах бензина",         25     , L"" },
    {24, AT_GOTO_ROOM, L"Пойти на запах еды",             26     , L"" },
    {24, AT_GOTO_ROOM, L"Пойти по дорожке из воды",       29     , L"" },
    {24, AT_GOTO_ROOM, L"Вернуться на дорогу",            9      , L"" },      

    {25, AT_LOOT,      L"Посмотреть в ведре",             25     , L"" },
    {25, AT_LOOT,      L"Глянуть в трупке",               33     , L"" },
    {25, AT_GOTO_ROOM, L"Пойти на след из кетчупа",       26     , L"" },
    {25, AT_GOTO_ROOM, L"Пойти на АЗС",                   25     , L"" },

    {26, AT_GET_MONEY, L"Посмотреть в касе",              3      , L"" },
    {26, AT_LOOT,      L"Посмотреть на полках",           15     , L"" },
    {26, AT_GOTO_ROOM, L"Подняться по коропкам",          27     ,  L""   },
    {26, AT_GOTO_ROOM, L"Пройти по узкой доске",          28     , L"" },
    {26, AT_GOTO_ROOM, L"Подойти к кононке",              25     , L"" },
    {26, AT_GOTO_ROOM, L"Пойти на АЗС",                   24     , L"" },

    {27, AT_HEAL,      L"Отдохнуть",                      4      , L"Облигчение" },
    {27, AT_GOTO_ROOM, L"Пойти прямо",                    30     , L"" },
    {27, AT_GOTO_ROOM, L"Вернуться в мини-маркет",        26     , L"" },

    {28, AT_MESSAGE,   L"Пукнуть",                        0      , L"Заваняло" },
    {28, AT_LOOT,      L"Посмотреть в мешках",            34     , L"" },
    {28, AT_GOTO_ROOM, L"Вернуться в мини-маркет",        26     , L"" },

    {29, AT_LOOT,      L"Разбить стекло машины",          42     , L"" },
    {29, AT_GOTO_ROOM, L"Уйти в мини-маркет",             26     , L"" },
    {29, AT_GOTO_ROOM, L"Пойти на АЗС",                   24     , L"" },

    {30, AT_LOOT,      L"Поискать в полках",              69     , L"Известного писателя" },
    {30, AT_MESSAGE,   L"Почитать газету",                0      , L"Вы стали умнее" },
    {30, AT_DAMAGE,    L"Выкурить окурок",                2      , L"Там была не трава" },
    {30, AT_GOTO_ROOM, L"Вернуться в комнату отдыха",     27     , L"" },

    {31, AT_GOTO_ROOM, L"Подойти к автобусу",            32    , L"" },
    {31, AT_GOTO_ROOM, L"Подойти к жыгули",              33    , L"" },
    {31, AT_GOTO_ROOM, L"Подойти к запорожцу",           34    , L"" },
    {31, AT_GOTO_ROOM, L"Подойти к ",                    35    , L"" },
    {31, AT_GOTO_ROOM, L"Подойти к ",                    36    , L"" },
    {31, AT_GOTO_ROOM, L"Вернуться на дорогу",           9     , L"" },

    //{32, , L"Вернуться на дорогу",           9     , L"" },
    //{32, AT_GOTO_ROOM, L"Вернуться",           31     , L"" },
};

int room_action_complete[action_count];